In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [22]:
df = sns.load_dataset('titanic')
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

### describe()

In [9]:
df.describe()    # 숫자형 데이터만 출력
df.describe(include='object')    # 모든 데이터의 통계값을 출력(count, unique, top, freq)

         sex embarked  who  embark_town alive
count    891      889  891          889   891
unique     2        3    3            3     2
top     male        S  man  Southampton    no
freq     577      644  537          644   549

### count()

In [10]:
df.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [13]:
df['who'].count()
df['age'].count()

np.int64(714)

### mean()

In [18]:
arr = np.arange(15).reshape(3,5)
temp_df = pd.DataFrame(arr)
temp_df

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14

In [20]:
df.mean(numeric_only=True)    # 숫자 데이터만 평균을 내주세요.

survived       0.383838
pclass         2.308642
age           29.699118
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

In [21]:
cond = df['adult_male'] == True
df.loc[cond, 'age'].mean()

np.float64(33.17312348668281)

- fare를 30 이상 40 미만 지불한 승객
- pclass 1등급

 => 나이 평균 / count

In [33]:
cond1 = df['fare'] >= 30
cond2 = df['fare'] < 40
cond3 = df['pclass'] == 1

print(df.loc[cond1 & cond2 & cond3, 'age'].count())
print(df.loc[cond1 & cond2 & cond3, 'age'].mean())
print(df.mean(numeric_only=True, skipna = False))

21
44.095238095238095
survived       0.383838
pclass         2.308642
age                 NaN
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

In [34]:
print(pd.Series([1, 2, 3, 4, 5]).median()
print(pd.Series([1, 2, 3, 4, 5]).mean())

np.float64(3.0)

### median

In [35]:
df['fare'].cumsum()    # 누적합 
df['fare'].cumprod

<bound method Series.cumprod of 0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
886    13.0000
887    30.0000
888    23.4500
889    30.0000
890     7.7500
Name: fare, Length: 891, dtype: float64>

# 평균

In [37]:
fare_mean = df['fare'].va;ies.mean()

AttributeError: 'Series' object has no attribute 'va'

In [38]:
df['fare'].var()

np.float64(2469.436845743116)

### min, max

### agg

### Quantile(분위)

### Unique

In [40]:
df['who'].unique()    # who 내부 고유값 출력

array(['man', 'woman', 'child'], dtype=object)

In [41]:
df['who'].nunique()    # 각 고유값의개수 출력

3

### mode

In [46]:
df['who'].mode()

0    man
Name: who, dtype: object

In [43]:
df['deck'].mode()

0    C
Name: deck, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

### corr
- -1(반비례) ~ 1(정비례) 까지의 값을 가짐.

In [48]:
df.corr(numeric_only=True)

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
survived,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307,-0.557080,-0.203367
pclass,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500,0.094035,0.135207
age,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067,0.280328,0.198270
sibsp,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651,-0.253586,-0.584471
parch,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225,-0.349943,-0.583398
fare,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000,-0.182024,-0.271832
adult_male,-0.557080,0.094035,0.280328,-0.253586,-0.349943,-0.182024,1.000000,0.404744
alone,-0.203367,0.135207,0.198270,-0.584471,-0.583398,-0.271832,0.404744,1.000000

In [50]:
df.corr(numeric_only=True)['survived']

survived      1.000000
pclass       -0.338481
age          -0.077221
sibsp        -0.035322
parch         0.081629
fare          0.257307
adult_male   -0.557080
alone        -0.203367
Name: survived, dtype: float64